app/views/portfolios/show.html.erb

      <h3>technologies</h3>
      <% @portfolio_item.technologies.each do |t| %>
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."portfolio_id" = $1  [["portfolio_id", 13]]