app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Blog 1"], ["body", "Testing the blog 1 description"], ["created_at", "2022-02-11 08:01:22.479497"], ["updated_at", "2022-02-11 08:01:22.479497"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "body" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_blog
    @blog = Blog.friendly.find(params[:id])