app/controllers/portfolios_controller.rb

  def edit
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def update
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

  def show
    @portfolio_item = Portfolio.find(params[:id])
---
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]